#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.test.google_kms_key_ring.keyring-us-east1: Refreshing state... [id=projects/cq-provider-gcp/locations/us-east1/keyRings/cq-secrets-keyring]
module.test.data.google_project.project: Reading...
module.test.google_pubsub_topic.pubsub-basic: Refreshing state... [id=projects/cq-provider-gcp/topics/cq-secrets-topic]
module.test.data.google_project.project: Read complete after 0s [id=projects/cq-provider-gcp]
module.test.google_kms_crypto_key.key-us-east1: Refreshing state... [id=projects/cq-provider-gcp/locations/us-east1/keyRings/cq-secrets-keyring/cryptoKeys/cq-secrets-cryptokey]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.test.google_secret_manager_secret.secret-basic will be created
  + resource "google_secret_manager_secret" "secret-basic" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "cq-secret"

      + replication {
          + user_managed {
              + replicas {
                  + location = "us-east1"

                  + customer_managed_encryption {
                      + kms_key_name = "projects/cq-provider-gcp/locations/us-east1/keyRings/cq-secrets-keyring/cryptoKeys/cq-secrets-cryptokey"
                    }
                }
            }
        }

      + rotation {
          + next_rotation_time = "2050-01-01T00:00:01Z"
          + rotation_period    = "3153600000s"
        }

      + topics {
          + name = "projects/cq-provider-gcp/topics/cq-secrets-topic"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @shimonp21, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*